Revit 2026 API

# FormRehost(SketchPlane, XYZ) Method

---

Rehost Form to sketch plane

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Rehost(
	SketchPlane sketchPlane,
	XYZ location
)
```
```vb
Public Sub Rehost (
	sketchPlane As SketchPlane,
	location As XYZ
)
```
```cpp
public:
void Rehost(
	SketchPlane^ sketchPlane,
	XYZ^ location
)
```
```fsharp
member Rehost :
        sketchPlane : SketchPlane *
        location : XYZ -> unit
```

#### Parameters

sketchPlane SketchPlane
    The sketch plane on which to rehost the form.
location XYZ
    The location to which to Rehost the form.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when the sketchPlane or location is . |
| InvalidOperationException | Thrown when rehosting Form failed. |

#### Reference

Form Class

Rehost Overload

Autodesk.Revit.DB Namespace